{"pageProps":{"project":{"title":"Cryptogalaxy: Visualizing cypto markets","date":"2022-12-11","slug":"cryptogalaxy","author":{"name":"Kim Dong Hun"},"content":"<p><a href=\"https://hunkim98.github.io/cryptogalaxy/\">Visit Website →</a></p>\n<p><img src=\"/assets/project/cryptogalaxy/logo.png\" alt=\"CryptoGalaxy Logo\"></p>\n<p><img src=\"/assets/project/cryptogalaxy/demo.gif\" alt=\"Demo\"></p>\n<p>CryptoGalaxy is an attempt that visualizes the Crypto Market in a fun and interactive way.</p>\n<p>Traditionally, markets are represented as a table of numbers, full of jargon. CryptoGalaxy aims to change that by providing a fun and interactive way to visualize the Crypto Market.</p>\n<p><img src=\"/assets/project/cryptogalaxy/screen.png\" alt=\"Crypto Planets Orbiting BTC Sun\"></p>\n<p>The conduits that convey information in CryptoGalaxy are the sun, planet, and spaceships. The Sun represents Bitcoin(BTC), and planets represent other coins such as Ethereum(ETH), Dogecoin(DOGE). The sentiments regarding a specific coin(planet) was shown with the in-and-outs of the spaceships.</p>\n<p>The indicators used for visualization were Moving Average Increase Rate, Market Capital, Relative Strength Index(RSI), Money Flow Index(MFI), and Correlation Coefficient of the trend similarity between BTC and a specific coin.</p>\n<h3>Sun</h3>\n<p>In CryptoGalaxy, the sun represents the Bitcoin as it is the first crypto currency to have appeared. To a sun, the most important feature is its brightness, and its brightness was connected with the Moving Average Increase Reat of the Bitcoin.</p>\n<h3>Planets</h3>\n<p>The planets that orbit around the sun represent other coins such as Ethereum(ETH), Dogecoin(DOGE). The size of the planet was connected to the Market Capital of the coin. Different from the sun, the planets have more features that can be connected with the indicators. The planet's orbit speed and ice-age degree were the features that were connected with the indicators. Similar to how the sun's brightness was connected to the Moving Average Increase Rate of the Bitcoin, the orbit speed of the planet was connected to the Moving Average Increase Rate of the coin. The ice-age degree was connected to the MFI of the coin.</p>\n<h3>Spaceships</h3>\n<p>The most dynamic component, the spaceships, represent the main activity happening to a specific coin. The in-and-outs represent the buying and selling of the coin. Since RSI is an indicator that shows the sentiment of the market, the in-and-outs of the spaceships were connected to the RSI of the coin.</p>\n<p>The project was built using Typescript and HTML Canvas. The data was fetched from Dunamu's Upbit API in real time. The project was deployed using Github Pages and later exhibited in Seoul National University's 2022 Visual Design Graduation Exhibition.</p>\n<p><img src=\"/assets/project/cryptogalaxy/front.jpg\" alt=\"Installation Viewed from Side\"></p>","keyword":"crypto","categories":["Data Visualization","Computer Graphics"],"thumbnail":"/assets/project/cryptogalaxy/demo.gif","excerpt":"CryptoGalaxy visualizes the crypto market through a dynamic, space-themed design. It connects galaxy components like the sun, planets, and spaceships to market indicators, providing an interactive, real-time representation of crypto trends.","data":{"title":"Cryptogalaxy: Visualizing cypto markets","excerpt":"CryptoGalaxy visualizes the crypto market through a dynamic, space-themed design. It connects galaxy components like the sun, planets, and spaceships to market indicators, providing an interactive, real-time representation of crypto trends.","startDate":"2022-09-01","date":"2022-12-11","author":{"name":"Kim Dong Hun"},"keyword":"crypto","categories":["Data Visualization","Computer Graphics"],"thumbnail":"/assets/project/cryptogalaxy/demo.gif","WIP":false},"prevPath":"/projects/webnovelr","nextPath":"/projects/dotting_genai","prevTitle":"Webnovelr: Text editor service for web novelers","nextTitle":"Dotting GenAI: Pixel Art Editor With Generative AI","isMdx":false}},"__N_SSG":true}