{"pageProps":{"project":{"title":"LinkLink: Visualize my social networks","date":"2022-12-08","slug":"linklink","author":{"name":"Kim Dong Hun"},"content":"<p><a href=\"https://github.com/swsnu/swppfall2022-team9/wiki/Requirements-and-Specification\">Project Wiki →</a></p>\n<p><img src=\"/assets/project/linklink/demo.gif\" alt=\"Demo\"></p>\n<p>When people start a startup, they start by finding suitable people to work with. In most cases, they reach out to their friends and ask them to join the startup. If the friends say that they are unavailable, then the person ask them to introduce their friends. This is because getting referrals from trusted relationships is the best way one can gather suitable companions. This process is very common in the startup world, and I have experienced this process myself. However, the problem is that this process is very inefficient. You have to meet each of your friends to get information about their acquaintances, and then ask your friends to introduce you some friends you think might fit with you.</p>\n<p>Would this whole process be simplified if there was a service that showed the qualities of the friends my friends have? If that was the case, I can directly contact my friend for a specific person that I have interest in. That is why I came up with LinkLink, a social networking application just for that purpose. There are many social networking applications out there such as LinkedIn. However the problem is that their purpose is too general, and thus not suitable for specific purposes. LinkLink focuses on the \"friend of a friend\" process, where one can view the qualities of the friends of their friends, and then ask the intermediary friend to introduce him or her to oneself.</p>\n<p><img src=\"/assets/project/linklink/home.png\" alt=\"Friend Network Visualization\"></p>\n<p>LinkedIn previously did a <a href=\"https://blog.linkedin.com/2011/01/24/linkedin-inmaps\">similar project</a> in 2011. It visualized all the networks of the acquaintances you had. However, the problem was that the visualization was too complex, and thus not very useful. There was too much information in the visualized network resulting in an ununderstandable mess. LinkLink solved this visual mess by putting a limit to how many direct friend connections one can have (one can only have a maximum of 15 direct friends). This benefits the service in two ways: 1) The service is more reliable since one has to carefully choose who to connect with, resulting in a more reliable network, 2) The user is able to understand the network better since there are less connections to look at.</p>\n<p><img src=\"/assets/project/linklink/profile.png\" alt=\"Personal Profile UI\"></p>\n<p><img src=\"/assets/project/linklink/evaluate.png\" alt=\"Evaluate Friends\"></p>\n<p>Since the main purpose of the application was to provide users with reliable networks, our team devised evaluation features for users to evaluate their directly connected friends. This could allow users to not only judge the fitness of another person based on their skillsets but also their character. When one finally decides they want to connect with that person, they can chat with the person directly or ask their intermediary friend to introduce them to the person.</p>\n<p><img src=\"/assets/project/linklink/chat.png\" alt=\"Chat\"></p>","keyword":"social network","categories":["data-visualization","social-network"],"thumbnail":"/assets/project/linklink/demo.gif","excerpt":"LinkLink is a social networking application that is focused on reaching out to the acquaintances of my friends. By providing a visualized social network graph consisted of my friends and the friends of my friends, one can find their suitable companions easily.","data":{"title":"LinkLink: Visualize my social networks","excerpt":"LinkLink is a social networking application that is focused on reaching out to the acquaintances of my friends. By providing a visualized social network graph consisted of my friends and the friends of my friends, one can find their suitable companions easily.","startDate":"2022-09-01","date":"2022-12-08","author":{"name":"Kim Dong Hun"},"keyword":"social network","categories":["data-visualization","social-network"],"thumbnail":"/assets/project/linklink/demo.gif","WIP":false},"prevPath":"/projects/toonie","nextPath":"/projects/webnovelr","prevTitle":"Toonie: Real-time Collaborative image review editor","nextTitle":"Webnovelr: Text editor service for web novelers","isMdx":false}},"__N_SSG":true}