{"pageProps":{"project":{"title":"Dotting GenAI: Pixel Art Editor With Generative AI","date":"2023-04-11","slug":"dotting_genai","author":{"name":"Kim Dong Hun"},"content":"<p><a href=\"https://www.youtube.com/watch?v=nKYJNuTxfTs\">Hackathon Presentation Video →</a></p>\n<p>\n<img alt=\"Demo\" width=\"100%\" src=\"/assets/project/dotting_genai/demo.gif\">\n<em>Demo</em>\n</p>\n<p>Generative AI is a hot topic discussed everywhere. In the hopes of decreasing the barrier for creating images, many researchers are publishing better image generation models everyday. However, one problem exists in current Generative AI services: You cannot modify the generated images once they are generated.</p>\n<p>For generative AI to be usable, the user should be able to modify the generated image. The modification can be as simple as changing the color of the generated image, or as complex as changing the shape of the generated image. For enabling modifications, the generative AI services should be integrated into an editor that provides additional tools that can be used to modify the generated images. However, there are no definitive software design principles on how to merge the two distinct experiences: generating and editing.</p>\n<p>To test the methods of integrating Generative AI into editors, I created a pixel art editor with Generative AI named Dotting GenAI. The project was also a contestant for the 2023 Hackathon hosted by the a Korean Venture Capital, Primer. Dotting GenAI was awarded as one of the top 16 projects in the hackathon. It was created with an opensource project that I have started to provide React developers a pixel art editor, <code>Dotting</code>.</p>\n<p>\n<img alt=\"Editor screen\" width=\"100%\" src=\"/assets/project/dotting_genai/home.png\">\n<em>Editor Screen</em>\n</p>\n<p>Dotting GenAI allows users to interact with the generative AI through a chat interface positioned on the right of the screen. The user can ask the generative AI to generate an image, and the generative AI will generate an image based on the user's request. The generated images will return as replies in the chat log. The user can place the generated image on the pixel art canvas and then modify the generated image with the editor tools provided by Dotting GenAI.</p>\n<p>After the development of the service, I conducted a user test on design experts to figure out 1) whether my software design approach was effective, and 2) whether the generative AI was useful for the design experts. The user test was conducted with 12 design experts, and the results showed some interesting insights.</p>\n<p>Most users thought the experience of being able to modify the generated images directly in the editor as comfortable. However, they had many worries about using generative AI in their work. Some reported that although generated images do encourage untried styles, they become a burden when the user wants to create a specific image they have in mind. Some also reported that they rather wanted a generative AI that learns from their own styles, rather than some random generated images based on prompts. People more interested in the study may download the <a target=\"_blank\" href=\"/assets/project/dotting_genai/dissertation.pdf\">PDF file</a> for more details.</p>\n<p>\n<img alt=\"Editor screen\" width=\"100%\" src=\"/assets/project/dotting_genai/presentation.png\">\n<em>Presentation in Primer Hackathon</em>\n</p>\n","keyword":"Generative AI","categories":["hackathon","AI","editor"],"coverImg":"/assets/project/dotting_genai/home.png"}},"__N_SSG":true}