{"pageProps":{"project":{"title":"Cryptogalaxy: Visualizing cypto markets","date":"2022-12-11","slug":"cryptogalaxy","author":{"name":"Kim Dong Hun"},"content":"<p><a href=\"https://hunkim98.github.io/cryptogalaxy/\">Visit Website →</a></p>\n<p>\n<img alt=\"cryptogalaxy logo\" width=\"100%\" src=\"/assets/project/cryptogalaxy/logo.png\">\n<em>CryptoGalaxy Logo</em>\n</p>\n<p>\n<img alt=\"Demo\" width=\"100%\" src=\"/assets/project/cryptogalaxy/demo.gif\">\n<em>Demo</em>\n</p>\n<p>CryptoGalaxy attempts to visualize the Crypto Market in a fun and interactive way.</p>\n<p>Traditionally, Markets are represented as a table of numbers, full of jargon and hard to understand. CryptoGalaxy aims to change that by providing a fun and interactive way to visualize the Crypto Market.</p>\n<p>The Crypto Market is a market where expert traders and normal traders participate in. Each participant hold to their own strategies and make decisions. To make a strategy, one must understand all sorts of indicators such as Moving Average, RSI, and so on. Unfortunately since all indicators are comprised of numbers and graph, it is very difficult for a newcomer to get familiar with trading.</p>\n<p>\n<img alt=\"yorkie_website\" width=\"600px\" src=\"/assets/project/cryptogalaxy/screen.png\">\n<em>Crypto Planets Orbiting BTC Sun</em>\n</p>\n<p>CryptoGalaxy is an attempt that visualizes the crypto market. It borrows its concept from the ‘space’ and connects galaxy components with several crypto market indicators. The main purpose of the project was to aid viewers understand the crypto market with visual components.</p>\n<p>The conduits that convey information in CryptoGalaxy are the sun, planet, and spaceships. The Sun represents Bitcoin(BTC), and planets represent other coins such as Ethereum(ETH), Dogecoin(DOGE). The sentiments regarding a specific coin(planet) was shown with the in-and-outs of the spaceships.</p>\n<p>The indicators used for visualization were Moving Average Increase Rate, Market Capital, Relative Strength Index(RSI), Money Flow Index(MFI), and Correlation Coefficient of the trend similarity between BTC and a specific coin. Since Moving Average Increase Rate is often related to how lucrative a coin is, the indicator was connected to the brightness of the sun(BTC), and the orbit speed of the planet(other coins) respectively. The Market Capital was connected to size of a planet. The RSI was connected to how spaceships come in to a planet and come out of the planet. The MFI was connected to the ice age degree of the planet. The Correlation Coefficient of the trend similarity between BTC and a specific coin was connected to how far a planet is from the sun.</p>\n<p>\n<img alt=\"yorkie_website\" width=\"600px\" src=\"/assets/project/cryptogalaxy/front.jpg\">\n<em>Installation Viewed from Front</em>\n</p>\n","keyword":"crypto","categories":["data-visualization"],"coverImg":"/assets/project/cryptogalaxy/logo.png","excerpt":"CryptoGalaxy is an attempt that visualizes the crypto market. It borrows its concept from the ‘space’ and connects galaxy components with several crypto market indicators. The main purpose of the project was to aid viewers understand the crypto market with visual components.","prevPath":"/projects/webnovelr","nextPath":"/projects/dotting_genai","prevTitle":"Webnovelr: Text editor service for web novelers","nextTitle":"Dotting GenAI: Pixel Art Editor With Generative AI"}},"__N_SSG":true}